<?xml version="1.0"?>
<net name="main_graph" version="11">
	<layers>
		<layer id="0" name="input" type="Parameter" version="opset1">
			<data shape="?,3,150,150" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="input">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="conv1.weight" type="Const" version="opset1">
			<data element_type="f32" shape="6, 3, 5, 5" offset="0" size="1800" />
			<output>
				<port id="0" precision="FP32" names="conv1.weight">
					<dim>6</dim>
					<dim>3</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="/conv1/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>6</dim>
					<dim>3</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>146</dim>
					<dim>146</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Reshape_3664" type="Const" version="opset1">
			<data element_type="f32" shape="1, 6, 1, 1" offset="1800" size="24" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>6</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="/conv1/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>146</dim>
					<dim>146</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>6</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/conv1/Conv_output_0">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>146</dim>
					<dim>146</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>146</dim>
					<dim>146</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/Relu_output_0">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>146</dim>
					<dim>146</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="/pool/MaxPool" type="MaxPool" version="opset8">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="2, 2" rounding_type="floor" auto_pad="explicit" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>146</dim>
					<dim>146</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/pool/MaxPool_output_0">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>73</dim>
					<dim>73</dim>
				</port>
				<port id="2" precision="I64">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>73</dim>
					<dim>73</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="conv2.weight" type="Const" version="opset1">
			<data element_type="f32" shape="16, 6, 5, 5" offset="1824" size="9600" />
			<output>
				<port id="0" precision="FP32" names="conv2.weight">
					<dim>16</dim>
					<dim>6</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="/conv2/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>73</dim>
					<dim>73</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>6</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>69</dim>
					<dim>69</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Reshape_3682" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="11424" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="/conv2/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>69</dim>
					<dim>69</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/conv2/Conv_output_0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>69</dim>
					<dim>69</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="/Relu_1" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>69</dim>
					<dim>69</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/Relu_1_output_0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>69</dim>
					<dim>69</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="/pool_1/MaxPool" type="MaxPool" version="opset8">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="2, 2" rounding_type="floor" auto_pad="explicit" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>69</dim>
					<dim>69</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/pool_1/MaxPool_output_0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>34</dim>
					<dim>34</dim>
				</port>
				<port id="2" precision="I64">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>34</dim>
					<dim>34</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Concat_3794" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="11488" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>34</dim>
					<dim>34</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Reshape_output_0">
					<dim>-1</dim>
					<dim>18496</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="fc1.weight" type="Const" version="opset1">
			<data element_type="f32" shape="120, 18496" offset="11504" size="8878080" />
			<output>
				<port id="0" precision="FP32" names="fc1.weight">
					<dim>120</dim>
					<dim>18496</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="/fc1/Gemm/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>18496</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>120</dim>
					<dim>18496</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Constant_5283" type="Const" version="opset1">
			<data element_type="f32" shape="1, 120" offset="8889584" size="480" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="/fc1/Gemm" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>120</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/fc1/Gemm_output_0">
					<dim>-1</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="/Relu_2" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/Relu_2_output_0">
					<dim>-1</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="fc2.weight" type="Const" version="opset1">
			<data element_type="f32" shape="84, 120" offset="8890064" size="40320" />
			<output>
				<port id="0" precision="FP32" names="fc2.weight">
					<dim>84</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="/fc2/Gemm/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>120</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>84</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Constant_5284" type="Const" version="opset1">
			<data element_type="f32" shape="1, 84" offset="8930384" size="336" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="/fc2/Gemm" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>84</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/fc2/Gemm_output_0">
					<dim>-1</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="/Relu_3" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/Relu_3_output_0">
					<dim>-1</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="fc3.weight" type="Const" version="opset1">
			<data element_type="f32" shape="5, 84" offset="8930720" size="1680" />
			<output>
				<port id="0" precision="FP32" names="fc3.weight">
					<dim>5</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="/fc3/Gemm/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>84</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>5</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Constant_5285" type="Const" version="opset1">
			<data element_type="f32" shape="1, 5" offset="8932400" size="20" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="output" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>5</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="output">
					<dim>-1</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="output/sink_port_0" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>5</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="2" to-port="0" />
		<edge from-layer="1" from-port="0" to-layer="2" to-port="1" />
		<edge from-layer="2" from-port="2" to-layer="4" to-port="0" />
		<edge from-layer="3" from-port="0" to-layer="4" to-port="1" />
		<edge from-layer="4" from-port="2" to-layer="5" to-port="0" />
		<edge from-layer="5" from-port="1" to-layer="6" to-port="0" />
		<edge from-layer="6" from-port="1" to-layer="8" to-port="0" />
		<edge from-layer="7" from-port="0" to-layer="8" to-port="1" />
		<edge from-layer="8" from-port="2" to-layer="10" to-port="0" />
		<edge from-layer="9" from-port="0" to-layer="10" to-port="1" />
		<edge from-layer="10" from-port="2" to-layer="11" to-port="0" />
		<edge from-layer="11" from-port="1" to-layer="12" to-port="0" />
		<edge from-layer="12" from-port="1" to-layer="14" to-port="0" />
		<edge from-layer="13" from-port="0" to-layer="14" to-port="1" />
		<edge from-layer="14" from-port="2" to-layer="16" to-port="0" />
		<edge from-layer="15" from-port="0" to-layer="16" to-port="1" />
		<edge from-layer="16" from-port="2" to-layer="18" to-port="0" />
		<edge from-layer="17" from-port="0" to-layer="18" to-port="1" />
		<edge from-layer="18" from-port="2" to-layer="19" to-port="0" />
		<edge from-layer="19" from-port="1" to-layer="21" to-port="0" />
		<edge from-layer="20" from-port="0" to-layer="21" to-port="1" />
		<edge from-layer="21" from-port="2" to-layer="23" to-port="0" />
		<edge from-layer="22" from-port="0" to-layer="23" to-port="1" />
		<edge from-layer="23" from-port="2" to-layer="24" to-port="0" />
		<edge from-layer="24" from-port="1" to-layer="26" to-port="0" />
		<edge from-layer="25" from-port="0" to-layer="26" to-port="1" />
		<edge from-layer="26" from-port="2" to-layer="28" to-port="0" />
		<edge from-layer="27" from-port="0" to-layer="28" to-port="1" />
		<edge from-layer="28" from-port="2" to-layer="29" to-port="0" />
	</edges>
	<rt_info>
		<Runtime_version value="2024.3.0-16041-1e3b88e4e3f-releases/2024/3" />
		<conversion_parameters>
			<input_model value="DIR\simple_cnn.onnx" />
			<is_python_object value="False" />
		</conversion_parameters>
	</rt_info>
</net>
